/**
 ******************************************************************************
 * @ 名称  系统程序
 * @ 版本  STD 库 V3.5.0
 * @ 描述  本文件的程序用于初始化定时器，提供定时器中断或PWM
 * @ 注意  本程序仅用于学习使用，适合嵌入式虚拟仿真实验教学平台及其配套硬件
 *	       受服务器性能和网络影响，仿真平台上程序的运行速度会比真实设备慢一些
 ******************************************************************************
 */
#ifndef __TIM_H
#define __TIM_H

#include "stm32f10x_conf.h"
#include <stdint.h>
#include "sys.h"

// 初始化定时器1
void TIM1_Init(uint16_t arr, uint16_t psc);
// 初始化定时器2
void TIM2_Init(uint16_t arr, uint16_t psc);

#endif
