/**
 ******************************************************************************
 * @ 名称  独立看门狗程序
 * @ 版本  STD 库 V3.5.0
 * @ 描述  本文件的程序用于提供窗口看门狗功能
 * @ 注意  本程序仅用于学习使用，适合嵌入式虚拟仿真实验教学平台及其配套硬件
 *	       受服务器性能和网络影响，仿真平台上程序的运行速度会比真实设备慢一些
 ******************************************************************************
 */
#ifndef __IWDG_H
#define __IWDG_H	    

#include "stm32f10x_iwdg.h"

//初始化独立看门狗
//prer:分频数:0~7(只有低3位有效!)
//分频因子=4*2^prer.但最大值只能是256!
//rlr:重装载寄存器值:低11位有效.
//时间计算(大概):Tout=((4*2^prer)*rlr)/40 (ms).
void IWDG_Init(uint8_t prer,uint16_t rlr) ;
// 喂狗
void IWDG_Feed(void);


#endif

 
