/**
 ******************************************************************************
 * @ 名称  窗口看门狗程序
 * @ 版本  STD 库 V3.5.0
 * @ 描述  本文件的程序用于提供窗口看门狗功能
 * @ 注意  本程序仅用于学习使用，适合嵌入式虚拟仿真实验教学平台及其配套硬件
 *	       受服务器性能和网络影响，仿真平台上程序的运行速度会比真实设备慢一些
 ******************************************************************************
 */
#ifndef __WWDG_H
#define __WWDG_H	    

#include "stm32f10x_wwdg.h"

//保存WWDG计数器的设置值,默认为最大. 
#define WWDG_CNT 0x7f

//初始化窗口看门狗 	
//tr   :T[6:0],计数器值 
//wr   :W[6:0],窗口值 
//fprer:分频系数（WDGTB）,仅最低2位有效 
//Fwwdg=PCLK1/(4096*2^fprer). 
void WWDG_Init(uint8_t tr,uint8_t wr,uint32_t fprer);
//重设置WWDG计数器的值
void WWDG_Set_Counter(uint8_t cnt);
//窗口看门狗中断服务程序
void WWDG_NVIC_Init();


#endif

 
