/**
 ******************************************************************************
 * @ 名称  串口重定向printf程序
 * @ 版本  STD 库 V3.5.0
 * @ 描述  本文件的程序用于将某个串口重定向为printf方法
 * 			修改 USART_PORT，可以实现不同 USART 的 printf 方法
 * @ 注意  本程序仅用于学习使用，适合嵌入式虚拟仿真实验教学平台及其配套硬件
 *	       受服务器性能和网络影响，仿真平台上程序的运行速度会比真实设备慢一些
 ******************************************************************************
 */
#ifndef __USART_H
#define __USART_H
#include "stdio.h"	
#include "sys.h" 

void USART2_Init(uint32_t baudrate);


#endif


